Revit 2026 API

# FilteredElementCollectorToElements Method

---

Returns the complete set of elements that pass the filter(s).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Element> ToElements()
```
```vb
Public Function ToElements As IList(Of Element)
```
```cpp
public:
IList<Element^>^ ToElements()
```
```fsharp
member ToElements : unit -> IList<Element>
```

#### Return Value

IListElement The complete set of element ids.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter. |

This will reset the collector to the beginning and extract all elements that pass the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace